Backend/app/controllers/api/v1/departments_controller.rb

SELECT "departments".* FROM "departments" ORDER BY "departments"."created_at" DESC
---
  def index
    pagy, departments = paginate(Department.order(created_at: :desc))

INSERT INTO "departments" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "5555555"], ["description", "555555gggg5"], ["created_at", "2022-11-25 07:42:28.364069"], ["updated_at", "2022-11-25 07:42:28.364069"]]
---
  def create
    department = Department.new(department_params)
    staff.save ? render_resource(department, status: :created) : render_resource_errors(department.errors)

UPDATE "departments" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "departments"."id" = $4  [["name", "tung"], ["description", "aaaaaaaaaaaaaaaaaa"], ["updated_at", "2022-11-28 09:41:48.330561"], ["id", 16]]
---
  def update
    @department.update(department_params) ? render_resource(@department) : render_resource_errors(@department.errors)

DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 1]]
---
  def destroy
    @department.destroy!

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def set_department
    @department = Department.find(params[:id])