Backend/app/controllers/api/v1/positions_controller.rb

  def index
    pagy, positions = paginate(Position.order(created_at: :desc))
---
SELECT "positions".* FROM "positions" ORDER BY "positions"."created_at" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    position = Position.new(position_params)
    position.save ? render_resource(position, status: :created) : render_resource_errors(position.errors)
---
INSERT INTO "positions" ("name", "department_id", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "5555555"], ["department_id", 2], ["description", "555555gggg5"], ["created_at", "2022-11-25 07:50:52.238396"], ["updated_at", "2022-11-25 07:50:52.238396"]]

  def update
    @position.update(position_params) ? render_resource(@position) : render_resource_errors(@position.errors)
---
UPDATE "positions" SET "name" = $1, "department_id" = $2, "description" = $3, "updated_at" = $4 WHERE "positions"."id" = $5  [["name", "tung"], ["department_id", 2], ["description", "tung1111"], ["updated_at", "2022-11-25 07:52:26.044100"], ["id", 1]]

  def destroy
    @position.destroy!
---
DELETE FROM "positions" WHERE "positions"."id" = $1  [["id", 1]]

  def set_position
    @position = Position.find(params[:id])
---
SELECT "positions".* FROM "positions" WHERE "positions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]