Backend/app/controllers/api/v1/staffs_controller.rb

SELECT COUNT(*) FROM "staffs"
SELECT "staffs".* FROM "staffs" ORDER BY "staffs"."created_at" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    pagy, staffs = paginate(Staff.order(created_at: :desc))

SELECT "staffs".* FROM "staffs" WHERE "staffs"."staff_id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_staff
    @staff = Staff.find(params[:id])