Backend/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("full_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    user = User.new(user_params)
    user.save ? render_resource(user, status: :created) : render_resource_errors(user.errors)