Backend/app/controllers/api/auth/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "vantung2102@gmail.com"], ["LIMIT", 1]]
---
  def log_in
    @user = User.find_by_email(params[:email])